app/views/comments/_comment.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."conspect_id" = ?  [["conspect_id", 1]]
---
<% @conspect.comments.each do |comment| %>