app/controllers/comments_controller.rb

SELECT  "conspects".* FROM "conspects" WHERE "conspects"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "conspect_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", ""], ["conspect_id", 7], ["created_at", "2018-11-19 08:03:27.269135"], ["updated_at", "2018-11-19 08:03:27.269135"]]
UPDATE "comments" SET "user_name" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["user_name", "mythbusterpeter@gmail.com"], ["updated_at", "2018-11-19 08:03:27.370310"], ["id", 12]]
---
  def create
    @conspect = Conspect.find(params[:conspect_id])
    @comment = @conspect.comments.create(params[:comment].permit(:user_name, :content))
    @comment.user_name = current_user.email
    @comment.save