app/controllers/conspects_controller.rb

SELECT COUNT(*) FROM "conspects"
SELECT  "conspects".* FROM "conspects" ORDER BY "conspects"."created_at" ASC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 150]]
---
  def index
    @conspects = Conspect.all.page params[:page]

INSERT INTO "conspects" ("title", "description", "speciality_number", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @conspect = Conspect.new(conspect_params)
    @conspect.user_id = current_user.id

    respond_to do |format|
      if @conspect.save

DELETE FROM "conspects" WHERE "conspects"."id" = ?  [["id", 2]]
---
  def destroy
    @conspect.destroy

SELECT  "conspects".* FROM "conspects" WHERE "conspects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_conspect
      @conspect = Conspect.find(params[:id])