app/controllers/users_controller.rb

  def index
    @users = User.all.page params[:page]
---
SELECT "users".* FROM "users"

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "admin" = ?, "blocked" = ? WHERE "users"."id" = ?  [["admin", 0], ["blocked", 1], ["id", 4]]